bit-finance/InformationRegisters/бит_НазначениеДополнительныхИзмерений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НазначениеДополнительныхИзмерений</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Синоним</Name>
					<Comment>Синоним</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Comment>Обязательное</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяТипаПоУмолчанию</Name>
					<Comment>Тип значения по умолчанию для аналитики составного типа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяИзмерения</Name>
					<Comment>Имя измерения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/InformationRegisters/бит_НазначениеДополнительныхИзмерений/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Использованные.ИмяИзмерения КАК ИмяИзмерения,
	|	Использованные.Аналитика КАК Аналитика
	|ИЗ
	|	РегистрСведений.бит_НазначениеДополнительныхИзмерений КАК Использованные";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	ВсеАналитики 	  = ВыгрузитьКолонку("Аналитика");
	РеквизитыАналитик = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ВсеАналитики, "ТипЗначения, Представление"); 
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.Аналитика) Тогда
			Продолжить;		
		КонецЕсли;
		
		ЗначениеКлюча  = Новый Структура("ИмяИзмерения", Запись.ИмяИзмерения); 
		КлючЗаписи 	   = РегистрыСведений.бит_НазначениеДополнительныхИзмерений.СоздатьКлючЗаписи(ЗначениеКлюча);
		
		РеквизитыАналитики = РеквизитыАналитик[Запись.Аналитика];
		
		// Проверка на примитивные типы
		МассивТипов		 = РеквизитыАналитики.ТипЗначения.Типы();		
		НедопустимыеТипы = Новый Массив;
		
		Для каждого ТекущийТип Из МассивТипов Цикл
			Если НЕ ОбщегоНазначения.ЭтоСсылка(ТекущийТип) Тогда
				НедопустимыеТипы.Добавить(Строка(ТекущийТип));
			КонецЕсли; 
		КонецЦикла;
		
		ТекстАналитика = Нстр("ru='Аналитика';en='Dimension'");
		Если ЗначениеЗаполнено(НедопустимыеТипы) Тогда			
			Пояснение = Нстр("ru='В составе типов обнаружены примитивные типы: %1. Допускаются только ссылочные типы.';
							 |en='As part of the type found primitive types:%1. Allowed only reference types.'");
			Пояснение = СтрШаблон(Пояснение, СтрСоединить(НедопустимыеТипы, ", ")); 
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "КОРРЕКТНОСТЬ", ТекстАналитика,,, Пояснение);			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, КлючЗаписи, "Запись.Аналитика",, Отказ);
		КонецЕсли; 
		
		Если Метаданные.ПланыСчетов.Количество() > 0 Тогда
			ВсеТипыПС = ПланыСчетов.ТипВсеСсылки().Типы();
			Для каждого ТипПС Из ВсеТипыПС Цикл
				Если Запись.Аналитика.ТипЗначения.СодержитТип(ТипПС) Тогда				
					Пояснение = НСтр("ru='Использование счетов в качестве дополнительных измерений запрещено.';
					|en='Accounts to be used as an additional measurement is prohibited.'");
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "КОРРЕКТНОСТЬ", ТекстАналитика,,, Пояснение);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, КлючЗаписи, "Запись.Аналитика",, Отказ);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;

		// На повторяемость.
		Выборка.Сбросить();
		Пока Выборка.НайтиСледующий(Новый Структура("Аналитика", Запись.Аналитика)) Цикл
			Если Выборка.ИмяИзмерения <> Запись.ИмяИзмерения Тогда
				Пояснение = НСтр("ru='Аналитика ""%1"" уже используется в измерении ""%2"".';
										   |en='Analysis ""%1"" is already used in the measurement of ""%2"".'");
				Пояснение = СтрШаблон(Пояснение, СокрЛП(РеквизитыАналитики.Представление), Выборка.ИмяИзмерения);
				
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "КОРРЕКТНОСТЬ", ТекстАналитика,,, Пояснение);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, КлючЗаписи, "Запись.Аналитика",, Отказ);
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 	
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда	
		ОбновитьПовторноИспользуемыеЗначения();	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
